[
  {
    "author": "Tyler T. ",
    "post_date": "January, 05 2024 ",
    "category": "Vapetasia News",
    "post_title": "VAPETASIA VS FDA ",
    "post_slug": "vapetasia-va-fda",
    "summary": "Vapetasia Scores Major Victory Against FDA in 2024 Ruling!",
    "banner": "PMTA-Decision.png",
    "thumbnail": "PMTA-Decision-Square.png",
    "body": "<h2>VAPETASIA VS FDA</h2>  <p>After a long wait, the U.S. Court of Appeals for the Fifth Circuit has issued its decision in our case against the Food and Drug Administration. By a vote of 10-6, the court sided with Vapetasia (Wages and White Lion Investments), overturning the FDA's original marketing denial orders (MDOs) for our products.</p><p>Though the FDA had previously said that it would provide guidance for the PMTA process, the Agency never made it clear what a successful application required — and, at times, moved the goalposts after we had filed our submissions. Our PMTA applications had to prove, in other words, that our products were 'appropriate for the protection of public health' (APPH), but the FDA was not transparent in how to meet that standard.</p><p>We remain optimistic that the FDA will now give us concrete instructions on what, if anything, is missing from our PMTAs — information that should benefit many of the small businesses that created this industry together.</p><p>We could not have gotten this far without the help of our good friends at Triton Distribution, Suicide Bunny, and everyone who has supported our company by either selling or consuming our products.</p> "
  },
  {
    "author": "Tyler T. ",
    "post_date": "January, 10 2023 ",
    "category": "Vapetasia News",
    "post_title": "Washington Flavor Ban SB 5239",
    "post_slug": "washington-flavor-ban-SB5239",
    "summary": "If passed, SB 5239 would allow DOH to ban all products that they deem unsafe, even if no harm or injury has been proven.",
    "banner": "Washington-flavor-ban-banner.jpg",
    "thumbnail": "Washington-flavor-Ban.jpg",
    "body": "<h2>A second flavor ban has been proposed in Washington that would devastate the vapor industry!</h2><p>Unfortunately for the state of Washington, the threat of another flavor ban is looming around the corner. Washington SB 5239 proposes legislation that would allow DOH to ban all products that they deem unsafe, even if no harm or injury has been proven. The legislation also includes a nicotine cap, flavor ban, additional labeling requirements, and more.</p><h2>We must do all that we can to STOP SB 5239! </h2> <div class=\"wasfa-button-row \"><a href=\"https://app.leg.wa.gov/pbc/bill/5239\" ><button class=\"vapetasia-button vapetasia-blog-sb5239-button\" type=\"button\">DO YOUR PART CLICK HERE!</button></a></div>\n \n<p>It is crucial that we as an industry, and the consumers in Washington, take action against this bill and others like it. By clicking the button you are able to submit a vote in favor or opposing this bill. We urge you to OPPOSE SB5239. By filling out this form you are doing your part in the combined effort to stop our government from overstepping their power and crushing our industry.</p><p>In addition, if you would like to stay up to date with the latest legislation updates within the state of Washington that pertain to the vapor industry. Please sign up for the Washington Smoke Free Association and become a member. You can get a free membership or make a donation towards their cause and become a member. This association brings industry leaders and community members together to collaborate and strategize ways to combat unfair legislation from our government all while keeping everyone updated on the latest news within the industry. <div class=\"wasfa-button-row wasfa-row\"> </p> <p><image class=\"wasfa-img\" src=\"https://cdn2.vapetasia.com/img/blog/WASFA.png \"></image>\n \n<a href=\"https://www.wasmokefree.org/about\"><button type=\"button\" class=\"vapetasia-button vapetasia-blog-sb5239-button\">BECOME A MEMBER!</button></a></p></div> "
  },
  {
    "author": "Howie G. ",
    "post_date": "January, 4 2021 ",
    "category": "Vapetasia News",
    "post_title": "The Ban on Vape Mail",
    "post_slug": "the-ban-on-vape-mail",
    "summary": "New policies regarding vape related mail will go into place within the next 90-120 days with the signing of the massive omnibus spending, coronavirus relief package. ",
    "banner": "Vape-Mail-Ban-Banner.jpg",
    "thumbnail": "Vape-Mail-Ban.jpg",
    "body": "New policies regarding vape related mail will go into place within the next 90-120 days with the signing of the massive omnibus spending, coronavirus relief package. The 2021 omnibus bill includes the “Preventing Online Sales of E-Cigarettes to Children Act,” which would make it illegal for a consumer to purchase any e-cigarette product online and have it shipped to them. The vape mail ban will be in full effect around the end of the first quarter of 2021. So what does this mean? There are two parts to this bill that we should look at. Unofficially the “Preventing Online Sales of E-Cigarettes to Children Act,” was referred to by many as the “vape mail ban.” As its unofficial name suggests, the bill will indeed require the US Postal Service to establish regulations within 120 days banning U.S. Mail delivery of vaping products. This would mean that consumers would not be able to purchase and ship vapor products through USPS. In addition, the bill also forces nicotine and cannabis vaping products to comply with the Prevent All Cigarette Trafficking (PACT) Act, which would impose stringent rules on online sellers. If the changes in policy are not followed within 90 days severe penalties will be issued, including up to three years in prison. \n \n So what does this mean? There are two parts to this bill that we should look at. Unofficially the “Preventing Online Sales of E-Cigarettes to Children Act,” was referred to by many as the “vape mail ban.” As its unofficial name suggests, the bill will indeed require the US Postal Service to establish regulations within 120 days banning U.S. Mail delivery of vaping products. This would mean that consumers would not be able to purchase and ship vapor products through USPS. In addition, the bill also forces nicotine and cannabis vaping products to comply with the Prevent All Cigarette Trafficking (PACT) Act, which would impose stringent rules on online sellers. If the changes in policy are not followed within 90 days severe penalties will be issued, including up to three years in prison. \n \n Online retailers will be required to: \n <li> Register with the U.S. Attorney General </li><li> Verify age of customers using a commercially available database</li><li> Use private shipping services that collect an adult signature at the point of delivery</li><li>If selling in states that tax vaping products, sellers must register with the federal government and with the tobacco tax administrators of the states</li><li>Collect all applicable local and state taxes, and affix any required tax stamps to the products sold</li><li>Send each taxing state’s tax administrator a list of all transactions with customers in their state, including the names and addresses of each customer sold to, and the quantities and type of each product sold</li><li>Maintain records for five years of any “delivery interrupted because the carrier or service determines or has reason to believe that the person ordering the delivery is in violation of the [PACT Act]</li> \n Sadly, lawmakers push policies under the guise of “protecting the children,” at the cost of tax paying adults. Ironically, the government tax-spending bill seems counter intuitive with addition of this act. While suffocating a tax-generating industry, lawmakers risk the health of their adult citizens by making safer nicotine products more difficult to purchase than cigarettes. With the going of USPS options for online sellers, private delivery services are being pressured to follow suit. Fedex is one of the first private mail services that has announced that changes to their mailing policy regarding vapor products will change during the first quarter of the new year. 2021 is starting out with one of the biggest changes in our industry and introduces us to a new era where a vape mail ban is a reality \n \n <a href={https://vapetasia.com/blog/}>Read More</a> About Vape Industry News and Regulations"
  },
  {
    "author": "Howie G. ",
    "post_date": "December 17, 2020 ",
    "category": "Vapetasia News",
    "post_title": "The Referendum has Delayed the California Flavor Ban",
    "post_slug": "the-referendum-has-delayed-the-california-flavor-ban",
    "summary": "The California Coalition for Fairness has gathered over a million signatures from registered voters in the state of California that are opposed to the flavor ban.",
    "banner": "California-Referendum-Banner.jpg",
    "thumbnail": "California-Referendum-Square.jpg",
    "body": "<p>The California Coalition for Fairness has gathered over a million signatures from registered voters in the state of California that are opposed to the flavor ban SB-793. SB-793 was going into effect on January 1st, 2021, but the referendum has delayed the California flavor ban till possibly the 2022 general election.</p><p>What is the proposed referendum process? Under California’s Constitution, State voters can propose referendums to approve or reject statutes enacted by the legislature. On November 24th, 2020, The California Coalition for Fairness stated they had submitted over 1 million signatures to local counties. The referendum petitioners have agreed to a joint stipulation with the California Attorney general and Secretary of State that, “SB-793 will not take effect on January 1st because the submission of over 100% of the required signatures has suspended the effective date, and that SB-793 will remain ineffective and unenforceable until either the referendum fails to qualify, or if it qualifies until the vote in the 2022 elections.” On December 10th, 2020, the stipulation was approved in California Court. The referendum has delayed the California flavor ban giving the vape industry time to advocate for the positives of flavors!</p><p>The referendum submitted by The California Coalition for Fairness has given vape businesses and customers extra time to advocate and educate others. Contact your local and state officials and speak to them about the positives of flavors for adults and the consequences a ban will have on yourself and businesses.</p>"
  },
  {
    "author": "Howie G. ",
    "post_date": "November 12, 2020 ",
    "category": "Vapetasia News",
    "post_title": "Australian Vapers Oppose the Prescription Model",
    "post_slug": "australian-vapers-oppose-the-prescription-model",
    "summary": "Australia has been unreasonable in regards to tobacco harm reduction and so we urge Australian vapers oppose the prescription model for smokeless nicotine products.",
    "banner": "Australia-Banner.jpg",
    "thumbnail": "Australia.jpg",
    "body": "<p>Australia has been unreasonable in regards to tobacco harm reduction and so we urge Australian vapers oppose the prescription model for smokeless nicotine products. Last July, the Federal health Minister of Australia Greg Hunt, announced ongoing talks with the country’s Border Force, regarding a ban on the importation of vape liquid containing nicotine. Also nicotine e-liquids would still be available through doctor’s prescription. The announcement caused an uproar with the Tobacco Harm Reduction experts and vaping advocates. Do to the announcement, numerous organizations and individuals like Australian Senator Matthew Canavan and MP George Christensen, started a petition to reverse the import ban and to instead have nicotine legalized and regulated</p><p>Last month, the National Retail Association (NRA) said that the proposal put forward by the government to consider allowing only pharmacies to sell smoke-free nicotine products is the “worst of both worlds,” for convenience shops. CEO Dominique Lamb said, “This makes no sense, that cigarettes would be freely available over the counter to corner stores and service stations, but the product that can help people transition away from smoking would be restricted. So outside doctor’s or pharmacists’ work hours, the only available option would be cigarettes. This flies in the face of common sense.” Swayed by the current laws and misinformation, the majority of doctors are already not looking to write nicotine prescriptions. Given the requirements to get a prescription for nicotine e-liquids even less doctors would be willing to write a prescription. Lamb also added that excluding small businesses from the safer alternatives’ market in this manner, would put these businesses at risk, disrupt market dynamics, and also be counterproductive to public health. We urge Australian vapers oppose the prescription model for smokeless nicotine products.</p>"
  },
  {
    "author": "Howie G. ",
    "post_date": "November 4, 2020 ",
    "category": "Vapetasia News",
    "post_title": "Nova Scotia Canada Cigarette Sales Increase following Flavor Ban",
    "post_slug": "nova-scotia-cigarette-sales-increase-following-flavor-ban",
    "summary": "Following the flavor ban in Nova Scotia Canada on April 1, 2020 cigarette sales have seen an unprecedented spike.",
    "banner": "Canada-Banner.jpg",
    "thumbnail": "Canada.jpg",
    "body": "<p>Following the flavor ban in Nova Scotia Canada on April 1, 2020 cigarette sales have seen an unprecedented spike. The Canadian Vaping Association (CVA) repeatedly warned the Government, “banning the sale of flavoured vapour products would cause a sudden increase in tobacco use.” The CVA was correct as Mike Hammoud, President of Atlantic Convenient Stores Association has said, “vapers have already begun switching from vaping to conventional cigarettes.” Along with the statement by Mike Hammoud, a new pole from Abacus Data shows that about 29% of the vaping population of Nova Scotia is at risk for returning to cigarettes. Nova Scotia Canada cigarette sales increase due to the passed legislation. </p><p>Tobacco sales had been in decline for a decade and due to the prohibition on flavors, it has directly affected smoking rates in Nova Scotia. “This is something that has kind of came out of nowhere for us on the scale of seeing such an increase in cigarettes,” said Hammoud. In spite of considerable amount of evidence presented to the government showing that flavor bans harm smokers, Nova Scotia continued with its horrible regulation. At the time of the legislation was passed, law makers were bombarded with misinformation and misrepresented data. The flavor ban fails to balance youth protection with adult harm reduction and we are unfortunately seeing the consequences of the failed regulation. Due to the flavor ban and excessive taxation, many vape shops in Nova Scotia have already closed.</p><p>Darryl Tempest the Executive Director of the CVA said, “It is our hope that Nova Scotia reviews the polling data and comes to understand the consequences of overly restrictive  regulations. There was significant pressure to act and we believe this led to rushed industry regulation that failed smokers and public health. Since that time, the science to support vaping as an effective harm reduction tool has continued to grow. The recent polling, tobacco sales data and the body of research supporting vaping paint a clear picture that Nova Scotia has made a mistake.”</p>"
  },
  {
    "author": "Howie G. ",
    "post_date": "October 30, 2020 ",
    "category": "Vapetasia News",
    "post_title": "Cochrane Review Asks Can Vaping Help You Quit Smoking?",
    "post_slug": "cochrane-review-asks-can-vaping-help-you-quit-smoking",
    "summary": "A new publication by the Cochrane Review shows “moderate-certainty evidence” that smoking quit rates were higher in participants using vaping products than those assigned nicotine replacement therapy products.",
    "banner": "Cochrane-Banner.jpg",
    "thumbnail": "Cochrane.jpg",
    "body": "<p>A new publication by the Cochrane Review shows “moderate-certainty evidence” that smoking quit rates were higher in participants using vaping products than those assigned nicotine replacement therapy products. Even though there has been a low amount of randomized control trials that included vaping, the Cochrane researchers found vapes to be likely superior to other nicotine replacement therapy products like gums or patches. The Cochrane researchers also stated that data from non-randomized studies also showed results consistent with the randomized control trials.</p><p>The Cochrane review is an update of a 2014 review which contains 50 studies, including 26 randomized control trials. In the publication it found users of vaping products did not have more serious health issues than nicotine replacement therapy product users or others using no quit aid at all. A senior author on the new review, Dr. Peter Hajek said, “The results of this new review of randomized trials of vaping tally with other evidence from cohort and epidemiological studies, suggesting that for many smokers, e-cigarettes represent an effective tool for quitting smoking.” He also said, “e-cigarettes are a form of nicotine replacement that is more attractive to smokers and that seems more effective than nicotine replacement therapy products.”  </p>"
  },
  {
    "author": "Howie G. ",
    "post_date": "October 28, 2020 ",
    "category": "Vapetasia News",
    "post_title": "JAMA Compares Vaping and Cigarette Users in Study",
    "post_slug": "journal-of-the-american-medical-association-compares-vaping-and-cigarettes",
    "summary": "The Journal of the American Medical Association (JAMA) compares vaping and cigarette users in a study showing the truth about vaping ",
    "banner": "JAMA-Banner.jpg",
    "thumbnail": "JAMA.jpg",
    "body": "<p>American vape studies usually show false information on how vaping is extremely detrimental to your health to push the public away from vaping. But recently The Journal of the American Medical Association (JAMA) compares vaping and cigarette users in a study showing the truth about vaping and how it is “10% to 98%” significantly lower concentrations of biomarkers of exposure, compared with exclusive cigarette smokers.” The study “Comparison of Nicotine and Toxicant Exposure in Users of Electronic Cigarettes and Combustible Cigarettes,” took into account biomarker concentrations in e-cigarette users only, combustible cigarette users only, dual users, and non-smokers / non-vapers. </p><p>Public health officials and the FDA always say that more research on the long term effects of vaping is needed before the U.S. Government can fully endorse vaping as a smoking cessation. CNN published a report that Dr. Maciej Goniewicz said, “Although the long-term health effects aren’t known, there are ways to estimate them.” “one of the ways to do that is to measure chemicals in our body that can indicate exposure to toxicants, so some biomarkers, and that is what we did in the study,” said Goniewicz.</p><p>Researchers conducted the study with 5,000 adult participants. They were divided into four groups; combustible tobacco cigarette smokers, vapers, dual users, and non-smokers. The data used was collected from 2013 to 2014 and came from the Population Assessment of Tobacco and Health study. 50 biomarkers used showed exposure to tobacco-related toxicants. </p><p>In conclusion, Dr. Goniewicz said, “The users of [e-cigarettes] are exposed to several toxicants. On the other hand, when we compared with the tobacco smokers, then we found that the levels of the toxicant in the e-cigarette users are significantly lower.” The mean concentration of total nicotine equivalents was 93% lower in e-cigarette-only users than in traditional cigarette smokers.</p>"
  },
  {
    "author": "Howie G. ",
    "post_date": "October 23, 2020 ",
    "category": "Vapetasia News",
    "post_title": "Journal of the American Heart Association Retracts Anti-Vaping Study",
    "post_slug": "journal-of-the-american-heart-association-retracts-anti-vaping-study",
    "summary": "Anti-Vaping study found unreliable and retracted! ",
    "banner": "JAHA-Banner.jpg",
    "thumbnail": "JAHA.jpg",
    "body": "<p>The editors of the Journal of the American Heart Association has announced that the article “Electronic Cigarette Use and Myocardial Infarction Among Adults in the US Population Assessment of Tobacco and Health,” is unreliable and has been officially retracted! This study was originally published in July of 2019, which declared vape usage and cigarette usage posed an equal threat to the human body.</p><p>A discovery found by reviewers and editors were unable to confirm if the authors of the above-referenced article know as PATH (Population Assessment of Tobacco and Health) fully understood or complied with certain requests regarding the timeline of e-cigarette usage before publishing. Due to the findings, the deadline set by the editors to revise and finish the analysis could not be met and were deemed unreliable and has been renounced by the Journal of the American Heart Association.</p><p>This news is overall a positive for the vape community, but the harm caused by the original publishing will take some time to recover from. We would like to thank the American Heart Association for withdrawing the article and hope that legislators take notice and rethink their views on a far better alternative meant for adults.</p><p>“Retraction to: Electronic Cigarette Use and Myocardial Infarction Among Adults in the US Population Assessment of Tobacco and Health.” Journal of the American Heart Association, vol. 9, no. 4, 18 Feb. 2020, 10.1161/jaha.119.014519. Accessed 23 Feb. 2020</p> "
  },
  {
    "author": "Howie G. ",
    "post_date": "October 22, 2020 ",
    "category": "Vapetasia News",
    "post_title": "Colorado VOTE NO to Prop EE and Make your Voice Heard",
    "post_slug": "colorado-vote-no-to-prop-ee-and-make-your-voice-heard",
    "summary": "What is Prop EE? Prop EE is a tax introduced Colorado which would increase the tax of nicotine-containing vapor products starting in 2021 if voted in.",
    "banner": "Colorado-Banner.jpg",
    "thumbnail": "Colorado.jpg",
    "body": "<p>What is Prop EE? Prop EE is a tax introduced Colorado which would increase the tax of nicotine-containing vapor products starting in 2021 if voted in. The tax would start at 30% in 2021 and overtime will increase to 62% by 2027. Prop EE requires Colorado residents to be voted on in the November ballots. We urge that Colorado VOTE NO to Prop EE on November 2020! Big taxes on tobacco products hurt small vape businesses and vape users overall. It increases the prices on vape products exponentially more then cigarettes. This makes it harder for people looking to find a better alternative to combustible cigarettes to make the switch and for local vape shops to stay open.</p><p>For reference, Pennsylvania passed a 40% vape tax in July 2016, which Elizabeth Stelle, director of policy analysis for the commonwealth foundation said, “The wholesale tax on vape shops was incredibly destructive to a very new industry.” She also said, “By the fall of 2016 shops began to close because owners could not afford to continue to do business.” We need to lead Colorado in a different path than Pennsylvania by voting NO to Prop EE this November. Keeping vape shops open helps adult smokers find a better alternative to combustible cigarettes! </p><p>Colorado VOTE NO to Prop EE on the November Ballot!</p><p>Keep up to date on proposed laws that affect the Vape Industry by signing up to our newsletter! </p>"
  },
  {
    "author": "Howie G. ",
    "post_date": "October 22, 2020 ",
    "category": "Vapetasia News",
    "post_title": "Oregon Vote NO on Measure 108 this November",
    "post_slug": "oregon-vote-no-on-measure-108",
    "summary": "A vape tax has been introduced in Oregon which would increase the tax on vape products by 65% of the wholesale price. ",
    "banner": "Oregon-Banner.jpg",
    "thumbnail": "Oregon.jpg",
    "body": "<p>A vape tax has been introduced in Oregon which would increase the tax on vape products by 65% of the wholesale price. Oregon voters please make sure to VOTE NO on measure 108 on the November Ballot! A 65% tax increase would do series harm to local vape businesses and to the end user. By increasing the tax on less harmful alternatives, this would push consumers to buy from neighboring states or online. Sales would dwindle in local small vape businesses which would force them to close up shop. This would lead to a lot of lost jobs.Oregon “Taxes on traditional cigarettes are intended to discourage use. But, e-cigarettes and other smoke-free tobacco products are estimated to be 98 – 99% less harmful than smoking. Discouraging use of these low-risk products is counter to the goals of reducing smoking rates.” quoted from Casaa.org. </p><p>Again Oregon residents please VOTE NO on MEASURE 108. Keep less harmful alternatives accessible to adults and keep small businesses alive in your state!</p><p>You can also join the fight at www.oregonvta.org and keep up to date on important vape related information by signing up to our Newsletter.</p>"
  },
  {
    "author": "Howie G. ",
    "post_date": "October 15, 2020 ",
    "category": "Vapetasia News",
    "post_title": "Say No to a Flavor Ban in AZ",
    "post_slug": "phoenix-flavor-ban",
    "summary": "With a flavor ban in Phoenix AZ being introduced to the Phoenix City Council, we need to make our voices heard.  ",
    "banner": "Arizona-Banner.jpg",
    "thumbnail": "Arizona.jpg",
    "body": "<h3>Phoenix City Council was just introduced a possible flavor ban.</h3><p>A flavor ban in Phoenix AZ is being introduced to the Phoenix City Council, we need to make our voices heard. The hearing on October 14th, 2020 had more than 90 people from retailers, health care advocates, and consumers requesting to speak. Adult consumers depend on flavors to quit cigarettes. Studies like the one published by the Journal of the American Medical Association, found that adults using flavored e-cigarette products were 2.3x more likely to quit smoking combustible cigarettes. Along with consumers, flavor bans are extremely harmful to small businesses. Flavors represent approximately 96% of e-liquid sales for local vape shops from the economic impact report showcased on Arizona Smoke Free Business Alliance website.. This ban would result in a 78% loss of revenue and the closure of all 36 locally owned vape shops in Phoenix. Flavor ban in Phoenix AZ</p><p>Those that are for the ban are trying to use children as their main focus for the reason for banning flavors. Alexa Wohrman a community advocacy advisor with the American Heart Association Greater Phoenix Division, told subcommittee members, “Fruit, mint, menthol and candy flavors make tobacco products more attractive to kids because they mask the harsh taste of tobacco and make these products seem harmless.” But flavors are not the main reason young people try e-cigarettes. The most recent National Youth Tobacco Survey conducted by the CDC provides some insight into youth behaviors. In this survey  conducted in 2019, almost 80% of young people said that something other than flavors led to trying e-cigarettes.</p><p>We need our voices to be heard. We urge you to continue to contact your law makers to oppose this potential flavor ban! Briefly share your story about switching to vaping and what role that flavors play in helping you live smoke free. Also note any health changes you’ve experienced. Discuss what losing access to a local supply of vapor products will mean for you. Always be kind and respectful when sending your message. CLICK HERE to send your message!</p>"
  },
  {
    "author": "Howie G. ",
    "post_date": "October 7, 2020 ",
    "category": "Vapetasia News",
    "post_title": "Keep Vape Mail Alive!",
    "post_slug": "keep-vape-mail-alive-say-no-to-s-1253",
    "summary": "Vape mail is a big thing for our industry especially for people who have disabilities, health issues, or live in rural areas that don’t have access to brick and mortar stores. ",
    "banner": "S1253-Banner.jpg",
    "thumbnail": "S1253.jpg",
    "body": "<p>Vape mail is a big thing for our industry especially for people who have disabilities, health issues, or live in rural areas that don’t have access to brick and mortar stores. S 1253 would prohibit the U.S. Postal Service from accepting packages of vapor products for delivery. While this is not a full ban on online sales, this means increased costs to consumers and new barriers for law-abiding adults. Vapers would have to pay an extra $15 to $20 for signature on delivery through UPS or Fedex.</p><p>Supporters of this bill argue that stopping the shipment of vapor products will reduce youth usage. What they won’t say is that less than 6% of youth report buying vapor products online. At the same time, this bill will do very little to discourage young people from seeking out informal sources of age-restricted and illicit products. Friends, family, and strangers will continue supplying underage experimenters while people who don’t have access to a reliable brick and mortar vape shop will be pressured to return to smoking.</p><p>Casaa has created an easy way for you to send a message to your lawmakers on their website! CLICK HERE to submit your opposition of S 1253!</p><p>Keep up to date on Industry updates through our newsletter! SIGN UP TODAY!</p>"
  },
  {
    "author": "Howie G. ",
    "post_date": "October 2, 2020 ",
    "category": "Vapetasia News",
    "post_title": "VTA Individual Memberships now available!",
    "post_slug": "vta-individual-memberships-now-available",
    "summary": "Since VTA is on the ground in D.C. and in the state capitals, they are able to provide their members with the most up-to-date information on all things vape related.",
    "banner": "VTA-Banner.jpg",
    "thumbnail": "VTA.jpg",
    "body": "<p><a href={https://vaportechnology.org/}>The Vapor Technology Association</a>has opened its doors to individual memberships!</p><p>“This membership will elevate the voices of vapers and those individuals who believe in vaping and engage them in the fight with access to cutting-edge advocacy tools,” the VTA said in a press release cited by the Vaping Post news site.</p><p><a href={https://vaportechnology.org/voices}>Individual memberships</a>costs $25 a year. Since VTA is on the ground in D.C. and in the state capitals, they are able to provide their members with the most up-to-date information on all things vape related. The individual memberships puts you in the position to be part of one of the most sophisticated and established lobbying efforts. The Vapor Technology Association has executed the most advanced and successful pro-vapor advocacy campaigns and is taking it to the next level! Along with your membership you will gain access to discounts on vapor products from participating stores all over the country.</p>"
  },
  {
    "author": "Howie G. ",
    "post_date": "September 29, 2020 ",
    "category": "Vapetasia News",
    "post_title": "Vapetasia PMTA Submitted",
    "post_slug": "vapetasia-pmta-update",
    "summary": "Vapetasia would like to announce the successful submission of our extensive and thorough Pre-Market Tobacco Application.",
    "banner": "PMTA-Banner.jpg",
    "thumbnail": "PMTA.jpg",
    "body": "<p>The whole vape industry is abuzz with discussions about the PMTA and it’s September 9th deadline. What is the Pre-Market Tobacco Application? The PMTA is an application that manufacturers in the tobacco industry must submit to the FDA. By submitting and gaining approval from the FDA, the manufacturer can continue the sale and marketing of its products. Unfortunately, the vape industry is being lumped in with tobacco products. E-juice Manufacturers and Vape shops that make their own e-liquids are required to submit a PMTA for each flavor. Even hardware products that are sold separately like drip tips and atomizers require an application to be submitted. Overall, the PMTA is to “provide scientific data that demonstrates a product is appropriate for the protection of public health.”</p><p> Vapetasia would like to announce the successful submission of our extensive and thorough Pre-Market Tobacco Application. On September 9, 2020, our application was hand-delivered to the FDA by Keller and Heckman LLP, assuring a timely acceptance. Vapetasia has worked cohesively and tirelessly to prepare and submit our application. We are confident that we have gone above and beyond the required expectations in our PMTAs. We have submitted applications for every flavor and nicotine combination we have out currently for all to continue to enjoy.</p><p>Vapetasia has always been committed to the Vapor Industry, continually advocating for safe alternatives to combustible tobacco. We will continue to fight for our consumer’s rights! We want to thank all our loyal customers for their continued patronage. Vapetasia looks forward to many more years creating products that help our current and future customers stay away from combustible cigarettes.</p><p>If you have any questions or just need more information on our submission, please do not hesitate to contact us!</p>"
  },
  {
    "author": "Howie G. ",
    "post_date": "September 28, 2020 ",
    "category": "Vapetasia News",
    "post_title": "The Flavor Ban SB 810 Vetoed, a Big Win for Florida!",
    "post_slug": "floridas-big-win-sb-810-vetoed",
    "summary": "The flavor ban SB 810 was vetoed by Governor DeSantis! This is a big win for the vape industry. Gov. DeSantis is the first to stand up to a flavor ban bill passed by the legislature.",
    "banner": "Florida-Banner.jpg",
    "thumbnail": "Florida.jpg",
    "body": "<p>The flavor ban SB 810 was vetoed by Governor DeSantis! This is a big win for the vape industry. Gov. DeSantis is the first to stand up to a flavor ban bill passed by the legislature. DeSantis is also the first to publicly acknowledge compelling data showing that passing such a bill would “almost assuredly lead more people to resume smoking cigarettes and it would drive others to the hazardous black market.”</p><p>By vetoing the flavor ban SB 810, Governor DeSantis is supporting decisions by FDA to allow low-risk flavored nicotine products on the market after concluding that these products meet the “appropriate for the protection of public health” standard.</p><p>We all in the vape industry would like to thank Gov. Desantis for his forward thinking and leadership! You can also take a moment to say “Thank you” to the governor for protecting consumers’ access to safer nicotine products! <a href={http://www.casaa.org/call-to-action/fl-take-action-to-stop-an-online-sales-ban/}>CLICK HERE</a></p>"
  }
]
