[
  {
    "author": "Howie G. ",
    "post_date": "January, 4 2021 ",
    "category": "Vapetasia News",
    "post_title": "The Ban on Vape Mail ",
    "post_slug": "/the-ban-on-vape-mail/ ",
    "summary": "New policies regarding vape related mail will go into place within the next 90-120 days with the signing of the massive omnibus spending, coronavirus relief package. ",
    "banner": "Vape-Mail-Ban-Banner.jpg",
    "thumbnail": "Vape-Mail-Ban-Thumbnail.jpg",
    "body": "New policies regarding vape related mail will go into place within the next 90-120 days with the signing of the massive omnibus spending, coronavirus relief package. The 2021 omnibus bill includes the “Preventing Online Sales of E-Cigarettes to Children Act,” which would make it illegal for a consumer to purchase any e-cigarette product online and have it shipped to them. The vape mail ban will be in full effect around the end of the first quarter of 2021. So what does this mean? There are two parts to this bill that we should look at. Unofficially the “Preventing Online Sales of E-Cigarettes to Children Act,” was referred to by many as the “vape mail ban.” As its unofficial name suggests, the bill will indeed require the US Postal Service to establish regulations within 120 days banning U.S. Mail delivery of vaping products. This would mean that consumers would not be able to purchase and ship vapor products through USPS. In addition, the bill also forces nicotine and cannabis vaping products to comply with the Prevent All Cigarette Trafficking (PACT) Act, which would impose stringent rules on online sellers. If the changes in policy are not followed within 90 days severe penalties will be issued, including up to three years in prison. \n \n So what does this mean? There are two parts to this bill that we should look at. Unofficially the “Preventing Online Sales of E-Cigarettes to Children Act,” was referred to by many as the “vape mail ban.” As its unofficial name suggests, the bill will indeed require the US Postal Service to establish regulations within 120 days banning U.S. Mail delivery of vaping products. This would mean that consumers would not be able to purchase and ship vapor products through USPS. In addition, the bill also forces nicotine and cannabis vaping products to comply with the Prevent All Cigarette Trafficking (PACT) Act, which would impose stringent rules on online sellers. If the changes in policy are not followed within 90 days severe penalties will be issued, including up to three years in prison. \n \n Online retailers will be required to: \n <li> Register with the U.S. Attorney General </li><li> Verify age of customers using a commercially available database</li><li> Use private shipping services that collect an adult signature at the point of delivery</li><li>If selling in states that tax vaping products, sellers must register with the federal government and with the tobacco tax administrators of the states</li><li>Collect all applicable local and state taxes, and affix any required tax stamps to the products sold</li><li>Send each taxing state’s tax administrator a list of all transactions with customers in their state, including the names and addresses of each customer sold to, and the quantities and type of each product sold</li><li>Maintain records for five years of any “delivery interrupted because the carrier or service determines or has reason to believe that the person ordering the delivery is in violation of the [PACT Act]</li> \n Sadly, lawmakers push policies under the guise of “protecting the children,” at the cost of tax paying adults. Ironically, the government tax-spending bill seems counter intuitive with addition of this act. While suffocating a tax-generating industry, lawmakers risk the health of their adult citizens by making safer nicotine products more difficult to purchase than cigarettes. With the going of USPS options for online sellers, private delivery services are being pressured to follow suit. Fedex is one of the first private mail services that has announced that changes to their mailing policy regarding vapor products will change during the first quarter of the new year. 2021 is starting out with one of the biggest changes in our industry and introduces us to a new era where a vape mail ban is a reality \n \n <a href={https://vapetasia.com/blog/}>Read More</a> About Vape Industry News and Regulations"
  },
  {
    "author": "Howie G. ",
    "post_date": "December 17, 2020 ",
    "category": "Vapetasia News",
    "post_title": "The Referendum has Delayed the California Flavor Ban",
    "post_slug": "/the-referendum-has-delayed-the-california-flavor-ban/",
    "summary": "The California Coalition for Fairness has gathered over a million signatures from registered voters in the state of California that are opposed to the flavor ban.",
    "banner": "Vape-Mail-Ban-Banner.jpg",
    "thumbnail": "Vape-Mail-Ban-Thumbnail.jpg",
    "body": "<p>The California Coalition for Fairness has gathered over a million signatures from registered voters in the state of California that are opposed to the flavor ban SB-793. SB-793 was going into effect on January 1st, 2021, but the referendum has delayed the California flavor ban till possibly the 2022 general election.</p><p>What is the proposed referendum process? Under California’s Constitution, State voters can propose referendums to approve or reject statutes enacted by the legislature. On November 24th, 2020, The California Coalition for Fairness stated they had submitted over 1 million signatures to local counties. The referendum petitioners have agreed to a joint stipulation with the California Attorney general and Secretary of State that, “SB-793 will not take effect on January 1st because the submission of over 100% of the required signatures has suspended the effective date, and that SB-793 will remain ineffective and unenforceable until either the referendum fails to qualify, or if it qualifies until the vote in the 2022 elections.” On December 10th, 2020, the stipulation was approved in California Court. The referendum has delayed the California flavor ban giving the vape industry time to advocate for the positives of flavors!</p><p>The referendum submitted by The California Coalition for Fairness has given vape businesses and customers extra time to advocate and educate others. Contact your local and state officials and speak to them about the positives of flavors for adults and the consequences a ban will have on yourself and businesses.</p>"
  }
]
