[
    {
        "post_title": "/the-ban-on-vape-mail/ ",
        "paragraph": "New policies regarding vape related mail will go into place within the next 90-120 days with the signing of the massive omnibus spending, coronavirus relief package. The 2021 omnibus bill includes the “Preventing Online Sales of E-Cigarettes to Children Act,” which would make it illegal for a consumer to purchase any e-cigarette product online and have it shipped to them. The vape mail ban will be in full effect around the end of the first quarter of 2021.         So what does this mean? There are two parts to this bill that we should look at. Unofficially the “Preventing Online Sales of E-Cigarettes to Children Act,” was referred to by many as the “vape mail ban.” As its unofficial name suggests, the bill will indeed require the US Postal Service to establish regulations within 120 days banning U.S. Mail delivery of vaping products. This would mean that consumers would not be able to purchase and ship vapor products through USPS. In addition, the bill also forces nicotine and cannabis vaping products to comply with the Prevent All Cigarette Trafficking (PACT) Act, which would impose stringent rules on online sellers. If the changes in policy are not followed within 90 days severe penalties will be issued, including up to three years in prison. Online retailers will be required to: Register with the U.S. Attorney General     Verify age of customers using a commercially available database        Use private shipping services that collect an adult signature at the point of delivery         If selling in states that tax vaping products, sellers must register with the federal government and with the tobacco tax administrators of the states         Collect all applicable local and state taxes, and affix any required tax stamps to the products sold         Send each taxing state’s tax administrator a list of all transactions with customers in their state, including the names and addresses of each customer sold to, and the quantities and type of each product sold         Maintain records for five years of any “delivery interrupted because the carrier or service determines or has reason to believe that the person ordering the delivery is in violation of the [PACT Act]”         Sadly, lawmakers push policies under the guise of “protecting the children,” at the cost of tax paying adults. Ironically, the government tax-spending bill seems counter intuitive with addition of this act. While suffocating a tax-generating industry, lawmakers risk the health of their adult citizens by making safer nicotine products more difficult to purchase than cigarettes. With the going of USPS options for online sellers, private delivery services are being pressured to follow suit. Fedex is one of the first private mail services that has announced that changes to their mailing policy regarding vapor products will change during the first quarter of the new year. 2021 is starting out with one of the biggest changes in our industry and introduces us to a new era where a vape mail ban is a reality. Read More About Vape Industry News and Regulations ",
        "banner": "Vape-Mail-Ban-Banner.jpg"
    }
]